In [11]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_csv('snp_extract.txt', header=None)

In [17]:
df = pd.read_csv('test_pop/Afr_test.a1tag.bim', header=None, sep='\t')

In [37]:
df = pd.read_csv('APOE_pop/Afr_test.a1tag.bim', header=None, sep='\t')

In [22]:
#df['pos'] = df[0].apply(lambda x: x.split(':')[1])

In [23]:
#df = df[df[0].str.startswith('17')]

In [24]:
#df['pos']=df['pos'].astype('int')

In [27]:
ukb = pd.read_csv('/home/lucytian/group/data/geno/ukb_genoHM3_exclude_v2.pvar', sep='\t')

/tmp/ipykernel_232158/4119096154.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  ukb = pd.read_csv('/home/lucytian/group/data/geno/ukb_genoHM3_exclude_v2.pvar', sep='\t')

In [33]:
ukb = ukb[ukb['#CHROM'] == '19']

In [35]:
ukb[(ukb['POS'] >= 45176340) & (ukb['POS'] <= 45447221)]

Empty DataFrame
Columns: [#CHROM, POS, ID, REF, ALT]
Index: []

In [18]:
! cat /home/lucytian/group/data/geno/exclude_ranges.txt

19	45176340	45447221	APOE

In [25]:
df

          0            1  2         3  4  5
0         1    rs3131962  0    756604  G  A
1         1  rs115991721  0    767096  G  A
2         1   rs12562034  0    768448  A  G
3         1    rs4040617  0    779322  G  A
4         1    rs2980300  0    785989  C  T
...      ..          ... ..       ... .. ..
1232017  22   rs73174435  0  51174939  T  C
1232018  22    rs3810648  0  51175626  G  A
1232019  22    rs3865764  0  51185848  G  A
1232020  22  rs142680588  0  51193629  G  A
1232021  22  rs116656403  0  51224208  A  G

[1232022 rows x 6 columns]

In [38]:
df[(df[3] >= 45176340) & (df[3] <= 45447221) & (df[0] == 19)]

          0            1  2         3  4  5
1156662  19    rs2965157  0  45176340  T  C
1156663  19   rs78626419  0  45179567  T  C
1156664  19   rs62119327  0  45186873  T  G
1156665  19    rs2965156  0  45188429  G  C
1156666  19    rs2965155  0  45188471  T  C
...      ..          ... ..       ... .. ..
1156967  19  rs114533385  0  45436753  T  C
1156968  19  rs192005985  0  45438138  C  T
1156969  19  rs118004808  0  45439498  T  C
1156970  19   rs79429216  0  45445517  A  G
1156971  19   rs12721109  0  45447221  A  G

[310 rows x 6 columns]

In [20]:
update_names = pd.read_csv('update_name.txt')